In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
data = "../csv/clean_vgsales.csv"
games_df = pd.read_csv(data)
games_df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38

In [3]:
games_df.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [4]:
games_df = games_df.rename(columns = {'Rank':'rank', 'Name':'name', 'Platform':'platform', 
                            'Year':'year', 'Genre':'genre', 'Publisher':'publisher', 
                            'NA_Sales':'na_sales', 'EU_Sales':'eu_sales', 'JP_Sales':'jp_sales', 'Other_Sales':'other_sales','Global_Sales':'global_sales'}).copy()
games_df.head()

,rank,name,platform,year,genre,publisher,na_sales,eu_sales,jp_sales,other_sales,global_sales
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38

In [5]:
#  Connect to local database
username = "postgres"
password = "1313"
rds_connection_string = f"{username}:{password}@localhost:5432/VideoGamesProject"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [7]:
# Making sure the table is properly made.
engine.table_names()

['games_data', 'year_data']

In [8]:
# Use pandas to load csv converted DataFrame into database for the video games sales data.
games_df.to_sql(name='games_data', con=engine, if_exists='append', index=False)

In [9]:
# Display final table
pd.read_sql_query('SELECT * FROM games_data', con=engine)

,rank,name,platform,year,genre,publisher,na_sales,eu_sales,jp_sales,other_sales,global_sales
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38
...,...,...,...,...,...,...,...,...,...,...,...
32577,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
32578,16597,Men in Black II: Alien Escape,GC,2003,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
32579,16598,SCORE International Baja 1000: The Official Game,PS2,2008,Racing,Activision,0.00,0.00,0.00,0.00,0.00
32580,16599,Know How 2,DS,2010,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
32581,16600,Spirits & Spells,GBA,2003,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [10]:
pd.read_sql_query('SELECT * FROM year_data', con=engine)

       year  na_sales  eu_sales  jp_sales  global_sales
0      2006     41.49     29.02      3.77         82.74
1      1985     29.08      3.58      6.81         40.24
2      2008     15.85     12.88      3.79         35.83
3      2009     15.75     11.01      3.28         33.00
4      1996     11.27      8.89     10.22         31.38
...     ...       ...       ...       ...           ...
16286  2002      0.01      0.00      0.00          0.01
16287  2003      0.01      0.00      0.00          0.01
16288  2008      0.00      0.00      0.00          0.00
16289  2010      0.00      0.01      0.00          0.01
16290  2003      0.01      0.00      0.00          0.01

[16291 rows x 5 columns]

In [22]:
pd.read_sql_query('SELECT * FROM data_2015', con=engine)

      year  na_sales  eu_sales  jp_sales  other_sales  global_sales
0     2015      5.77      5.81      0.35         2.31         14.24
1     2015      1.11      6.06      0.06         1.26          8.49
2     2015      2.93      3.29      0.22         1.23          7.67
3     2015      4.52      2.09      0.01         0.67          7.29
4     2015      2.47      3.15      0.24         1.10          6.96
...    ...       ...       ...       ...          ...           ...
1223  2015      0.00      0.00      0.01         0.00          0.01
1224  2015      0.00      0.00      0.01         0.00          0.01
1225  2015      0.00      0.00      0.01         0.00          0.01
1226  2015      0.00      0.00      0.01         0.00          0.01
1227  2015      0.00      0.01      0.00         0.00          0.01

[1228 rows x 6 columns]

In [28]:
print(f"2015 NA sales:")
pd.read_sql_query('SELECT SUM(na_sales) FROM data_2015', con=engine)

2015 NA sales:

      sum
0  205.64

In [27]:
print(f"2015 EU sales:")
pd.read_sql_query('SELECT SUM(eu_sales) FROM data_2015', con=engine)

2015 EU sales:

      sum
0  195.42

In [26]:
print(f"2015 JP sales:")
pd.read_sql_query('SELECT SUM(jp_sales) FROM data_2015', con=engine)

2015 JP sales:

     sum
0  67.44

In [25]:
print(f"2015 Other sales:")
pd.read_sql_query('SELECT SUM(other_sales) FROM data_2015', con=engine)

2015 Other sales:

     sum
0  60.02

In [29]:
print(f"2015 Global sales:")
pd.read_sql_query('SELECT SUM(global_sales) FROM data_2015', con=engine)

2015 Global sales:

      sum
0  528.52

In [33]:
pd.read_sql_query('SELECT * FROM data_2016', con=engine)

     year  na_sales  eu_sales  jp_sales  other_sales  global_sales
0    2016      0.28      3.75      0.06         0.69          4.78
1    2016      1.30      2.07      0.18         0.65          4.20
2    2016      1.28      1.61      0.15         0.57          3.61
3    2016      0.59      1.16      0.06         0.33          2.14
4    2016      1.20      0.62      0.00         0.18          2.00
..    ...       ...       ...       ...          ...           ...
679  2016      0.01      0.00      0.00         0.00          0.01
680  2016      0.01      0.00      0.00         0.00          0.01
681  2016      0.00      0.01      0.00         0.00          0.01
682  2016      0.00      0.01      0.00         0.00          0.01
683  2016      0.00      0.00      0.01         0.00          0.01

[684 rows x 6 columns]

In [34]:
print(f"2016 NA sales:")
pd.read_sql_query('SELECT SUM(na_sales) FROM data_2016', con=engine)

2016 NA sales:

     sum
0  45.32

In [59]:
print(f"2016 EU sales:")
pd.read_sql_query('SELECT SUM(eu_sales) FROM data_2016', con=engine)

2016 EU sales:

     sum
0  53.52

In [58]:
print(f"2016 JP sales:")
pd.read_sql_query('SELECT SUM(jp_sales) FROM data_2016', con=engine)

2016 JP sales:

     sum
0  27.34

In [56]:
print(f"2016 Other sales:")
pd.read_sql_query('SELECT SUM(other_sales) FROM data_2016', con=engine)

2016 Other sales:

    sum
0  15.5

In [57]:
print(f"2016 Global sales:")
pd.read_sql_query('SELECT SUM(global_sales) FROM data_2016', con=engine)

2016 Global sales:

      sum
0  141.68

In [39]:
pd.read_sql_query('SELECT * FROM data_2017', con=engine)

   year  na_sales  eu_sales  jp_sales  other_sales  global_sales
0  2017       0.0       0.0      0.03          0.0          0.03
1  2017       0.0       0.0      0.01          0.0          0.01
2  2017       0.0       0.0      0.01          0.0          0.01
3  2017       0.0       0.0      0.03          0.0          0.03
4  2017       0.0       0.0      0.01          0.0          0.01
5  2017       0.0       0.0      0.01          0.0          0.01

In [40]:
print(f"2017 NA sales:")
pd.read_sql_query('SELECT SUM(na_sales) FROM data_2017', con=engine)

2017 NA sales:

   sum
0  0.0

In [48]:
print(f"2017 EU sales:")
pd.read_sql_query('SELECT SUM(eu_sales) FROM data_2017', con=engine)

2017 EU sales:

   sum
0  0.0

In [49]:
print(f"2017 JP sales:")
pd.read_sql_query('SELECT SUM(jp_sales) FROM data_2017', con=engine)

2017 JP sales:

   sum
0  0.1

In [50]:
print(f"2017 Other sales:")
pd.read_sql_query('SELECT SUM(other_sales) FROM data_2017', con=engine)

2017 Other sales:

   sum
0  0.0

In [51]:
print(f"2017 Global sales:")
pd.read_sql_query('SELECT SUM(global_sales) FROM data_2017', con=engine)

2017 Global sales:

   sum
0  0.1

In [46]:
pd.read_sql_query('SELECT * FROM data_2020', con=engine)

   year  na_sales  eu_sales  jp_sales  other_sales  global_sales
0  2020      0.27       0.0       0.0         0.02          0.29
1  2020      0.27       0.0       0.0         0.02          0.29

In [47]:
print(f"2020 NA sales:")
pd.read_sql_query('SELECT SUM(na_sales) FROM data_2020', con=engine)

2020 NA sales:

    sum
0  0.54

In [52]:
print(f"2020 EU sales:")
pd.read_sql_query('SELECT SUM(eu_sales) FROM data_2020', con=engine)

2020 EU sales:

   sum
0  0.0

In [53]:
print(f"2020 JP sales:")
pd.read_sql_query('SELECT SUM(jp_sales) FROM data_2020', con=engine)

2020 JP sales:

   sum
0  0.0

In [54]:
print(f"2020 Other sales:")
pd.read_sql_query('SELECT SUM(other_sales) FROM data_2020', con=engine)

2020 Other sales:

    sum
0  0.04

In [55]:
print(f"2020 Global sales:")
pd.read_sql_query('SELECT SUM(global_sales) FROM data_2020', con=engine)

2020 Global sales:

    sum
0  0.58

In [64]:
lineChartPoints = {
    'year': [2015, 2016, 2017, 2020],
    'na_sales': [205.64, 45.32, 0.0, 0.54],
    'eu_ales': [195.42, 53.52, 0.0, 0.0],
    'jp_ales': [67.44, 27.34, 0.1, 0.0],
    'other_sales': [60.02, 15.5, 0.0, 0.04],
    'global_sales': [528.52, 141.68, 0.1, 0.58]
}

In [77]:
lineChartDataframe = pd.DataFrame(data=lineChartPoints, index=None)
lineChartDataframe

   Year  NA Sales  EU Sales  JP Sales  Other Sales  Global Sales
0  2015    205.64    195.42     67.44        60.02        528.52
1  2016     45.32     53.52     27.34        15.50        141.68
2  2017      0.00      0.00      0.10         0.00          0.10
3  2020      0.54      0.00      0.00         0.04          0.58

In [88]:
lineChartDataframe.to_json("../../app/static/json/salesByYear.json", orient="columns")